In [2]:
import pandas as pd
import numpy as np
from io import StringIO

pd.read_csv('rename.csv')

   id     name  age  salary
0   1    Alice   23   50000
1   2      Bob   30   60000
2   3  Charlie   35   70000
3   4    David   28   55000
4   5      Eva   26   52000

In [4]:
# Use to read particular column
pd.read_csv('rename.csv',usecols=['id','name'])

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David
4   5      Eva